
## Plan Result (aat)




<pre><code>Plan: 1 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.redis_access_key
* Update
  * module.et-frontend-session-storage.azurerm_redis_cache.redis


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.redis_access_key will be created
  + resource "azurerm_key_vault_secret" "redis_access_key" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-aat/providers/Microsoft.KeyVault/vaults/et-aat"
      + name                    = "redis-access-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.et-frontend-session-storage.azurerm_redis_cache.redis will be updated in-place
  ~ resource "azurerm_redis_cache" "redis" {
        id                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-syr-session-storage-cache-aat/providers/Microsoft.Cache/redis/et-syr-session-storage-aat"
        name                          = "et-syr-session-storage-aat"
        tags                          = {
            "application"         = "employment-tribunals"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/et-syr-frontend.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#et-developers"
            "environment"         = "staging"
            "managedBy"           = "Employment Tribunals"
        }
        # (23 unchanged attributes hidden)

      ~ redis_configuration {
          ~ maxfragmentationmemory_reserved         = 125 -> 642
          ~ maxmemory_delta                         = 125 -> 642
          ~ maxmemory_reserved                      = 125 -> 642
            # (14 unchanged attributes hidden)
        }
    }

Plan: 1 to add, 1 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":6,"Program":"tfcmt","SHA1":"","Target":"aat","Vars":{}} -->